execphantasmagoria/ESP32MarauderOLED_BN/esp32_marauder/configs.h
  #ifdef MARAUDER_CYD_2USB
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_CYD_TOUCH
    #define HAS_CYD_PORTRAIT
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
  #endif

  #ifdef MARAUDER_CYD_3_5_INCH
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    //#define HAS_CYD_TOUCH
    #define HAS_SEPARATE_SD
    #define HAS_CYD_PORTRAIT
    //#define HAS_NIMBLE_2
  #endif

  #ifdef MARAUDER_CYD_GUITION
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    //#define HAS_CYD_TOUCH
    //#define HAS_NIMBLE_2
  #endif

  #ifdef MARAUDER_KIT
    #define HAS_TOUCH
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_C5_SD
  #endif

  #ifdef GENERIC_ESP32
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
    //#define HAS_NIMBLE_2
  #endif

  #ifdef MARAUDER_FLIPPER
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    //#define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_GPS
    #define HAS_SD
    #define USE_SD
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
  #endif

  #ifdef MARAUDER_MULTIBOARD_S3
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_GPS
    #define HAS_SD
    #define USE_SD
    //#define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
  #endif

  #ifdef ESP32_LDDB
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_SD
    #define USE_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
  #endif

  #ifdef MARAUDER_DEV_BOARD_PRO
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_SD
    #define USE_SD
    //#define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
  #endif

  #ifdef XIAO_ESP32_S3
    #define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
  #endif

  #ifdef MARAUDER_C5
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_GPS
    #define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    //#define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
  #endif

  #ifdef MARAUDER_V8
    #define HAS_TOUCH
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_GPS
    #define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
  #endif

  #ifdef MARAUDER_MINI_V3
    //#define HAS_TOUCH
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_MINI_KB
    #define HAS_SCREEN
    #define HAS_MINI_SCREEN
    #define HAS_GPS
    #define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    //#define HAS_SIMPLEX_DISPLAY
  #endif

  #ifdef ESP32_OLED_NO_TOUCH
    //#define HAS_TOUCH
    #define HAS_OLED_DISPLAY
    #define SDA_PIN 21
    #define SCL_PIN 22
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    //#define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_FULL_SCREEN
    //#define HAS_GPS
    //#define HAS_C5_SD
    //#define HAS_SD
    //#define USE_SD
    //#define HAS_DUAL_BAND
    //#define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    //#define HAS_NIMBLE_2
    //#define HAS_IDF_3
  #endif

  #ifdef ESP32_TFT_NO_TOUCH
    //#define HAS_TOUCH
    #define HAS_TFT_DISPLAY
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_BUTTON_PAD
    #define USES_APP_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_FULL_SCREEN
    #define HAS_128x160_SCREEN
    //#define HAS_GPS
    //#define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    //#define HAS_DUAL_BAND
    //#define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    //#define HAS_IDF_3
  #endif
  //// END BOARD FEATURES

