execphantasmagoria/ESP32MarauderOLED_BN/esp32_marauder/configs.h
    #define COMMAND_PREFIX "!"
    
    // Keypad start position, key sizes and spacing
    #define KEY_X (TFT_WIDTH/2) // Centre of key
    #define KEY_Y (TFT_HEIGHT/4.5)
    #define KEY_W TFT_WIDTH // Width and height
    #define KEY_H (TFT_HEIGHT/12.8)
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 10
  #endif
  //// END MENU DEFINITIONS

  //// SD DEFINITIONS
  #if defined(USE_SD)

    #ifdef MARAUDER_V4
      #define SD_CS 12
    #endif

    #ifdef MARAUDER_V6
      #define SD_CS 12
    #endif

    #ifdef MARAUDER_V6_1
      #define SD_CS 14
    #endif

    #ifdef MARAUDER_CYD_MICRO
      #define SD_CS 5
    #endif

    #ifdef MARAUDER_CYD_2USB
      #define SD_CS 5
    #endif

    #ifdef MARAUDER_CYD_3_5_INCH
      #define SD_CS 5
    #endif

    #ifdef MARAUDER_CYD_GUITION
      #define SD_CS 5
    #endif

    #ifdef MARAUDER_KIT
      #define SD_CS 12
    #endif

    #ifdef MARAUDER_MINI
      #define SD_CS 4
    #endif

    #ifdef MARAUDER_V7
      #define SD_CS 4
    #endif

    #ifdef MARAUDER_V7_1
      #define SD_CS 4
    #endif

    #ifdef MARAUDER_REV_FEATHER
      #define SD_CS 5
    #endif

    #ifdef MARAUDER_M5STICKC
      #define SD_CS -1
    #endif

    #ifdef MARAUDER_CARDPUTER
      //#define SS      12
      #define SD_CS   12
      #define SD_SCK  40
      #define SD_MISO 39
      #define SD_MOSI 14
    #endif

    #ifdef MARAUDER_FLIPPER
      #define SD_CS 10
    #endif

    #ifdef MARAUDER_MULTIBOARD_S3
      #define SD_CS 10
    #endif

    #ifdef ESP32_LDDB
      #define SD_CS 4
    #endif

    #ifdef MARAUDER_DEV_BOARD_PRO
      #define SD_CS 4
    #endif

    #ifdef XIAO_ESP32_S3
      #define SD_CS 3
    #endif

    #ifdef MARAUDER_C5
      #define SD_CS 10
    #endif

    #ifdef MARAUDER_V8
      #define SD_CS 10
    #endif

    #ifdef MARAUDER_MINI_V3
      #define SD_CS 10
    #endif

    #ifdef ESP32_TFT_NO_TOUCH
      #define SD_CS 15
      #define SD_SCK 27
      #define SD_MISO 26
      #define SD_MOSI 25
    #endif

  #endif
  //// END SD DEFINITIONS

  //// SPACE SAVING COLORS
  #define TFTWHITE     1
  #define TFTCYAN      2
  #define TFTBLUE      3
  #define TFTRED       4
  #define TFTGREEN     5
  #define TFTGREY      6
  #define TFTGRAY      7
  #define TFTMAGENTA   8
  #define TFTVIOLET    9
  #define TFTORANGE    10
  #define TFTYELLOW    11
  #define TFTLIGHTGREY 12
  #define TFTPURPLE    13
  #define TFTNAVY      14
  #define TFTSILVER    15
  #define TFTDARKGREY  16
  #define TFTSKYBLUE   17
  #define TFTLIME      18
  //// END SPACE SAVING COLORS

  #define TFT_FARTGRAY 0x528a

  //// SCREEN STUFF
  #ifndef HAS_SCREEN

    #define BANNER_TIME GRAPH_REFRESH

    #define TFT_BLACK 0
    #define TFT_WHITE 0
    #define TFT_CYAN 0
    #define TFT_BLUE 0
    #define TFT_RED 0
    #define TFT_GREEN 0
    #define TFT_GREY 0
    #define TFT_GRAY 0
    #define TFT_MAGENTA 0
    #define TFT_VIOLET 0
    #define TFT_ORANGE 0
    #define TFT_YELLOW 0
    #define STANDARD_FONT_CHAR_LIMIT 40
    #define FLASH_BUTTON -1

    #define CHAN_PER_PAGE 7

    #include <FS.h>
    #include <functional>
    #include <LinkedList.h>
    #include "SPIFFS.h"
    #include "Assets.h"

  #endif
  //// END SCREEN STUFF

  //// MEMORY LOWER LIMIT STUFF
  // These values are in bytes
  #ifdef MARAUDER_M5STICKC
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CARDPUTER)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_MINI)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V7)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V7_1)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_REV_FEATHER)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V4)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_MICRO)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_2USB)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_3_5_INCH)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_GUITION)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_KIT)
    #define MEM_LOWER_LIM 10000
  #elif defined(GENERIC_ESP32)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_FLIPPER)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_MULTIBOARD_S3)
    #define MEM_LOWER_LIM 10000
  #elif defined(ESP32_LDDB)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_DEV_BOARD_PRO)
    #define MEM_LOWER_LIM 10000
  #elif defined(XIAO_ESP32_S3)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_C5)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V8)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_MINI_V3)
    #define MEM_LOWER_LIM 10000
  #elif defined(ESP32_OLED_NO_TOUCH)
    #define MEM_LOWER_LIM 10000
  #endif
  //// END MEMORY LOWER LIMIT STUFF

  //// NEOPIXEL STUFF  
  #ifdef HAS_NEOPIXEL_LED
    
    #if defined(ESP32_LDDB)
      #define PIN 17
    #elif defined(MARAUDER_DEV_BOARD_PRO)
      #define PIN 16
    #elif defined(MARAUDER_REV_FEATHER)
      #define PIN 33
    #elif defined(MARAUDER_CYD_MICRO)
      #define PIN 4
    #elif defined(MARAUDER_CYD_2USB)
      #define PIN 4
    #elif defined(MARAUDER_CYD_3_5_INCH)
      #define PIN 22
    #elif defined(MARAUDER_C5)
      #define PIN 27
    #elif defined(MARAUDER_V8)
      #define PIN 27
    #else
      #define PIN 25
    #endif
  
  #endif
  //// END NEOPIXEL STUFF

  //// EVIL PORTAL STUFF

  #ifdef HAS_PSRAM
    #define MAX_HTML_SIZE 30000
  #else
    #define MAX_HTML_SIZE 11400
  #endif

  //// END EVIL PORTAL STUFF

  //// GPS STUFF
  #ifdef HAS_GPS
    #ifdef HAS_PSRAM
      #define mac_history_len 500
    #else
      #define mac_history_len 100
    #endif

    #define mac_history_len_half (mac_history_len / 2)

    #if defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 4
      #define GPS_RX 13
    #elif defined(MARAUDER_CYD_MICRO)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 22 // Whoever thought it would be a good idea to use UART0 for GPS...
      #define GPS_RX 27 // Now maybe we will be able to use CLI
    #elif defined(MARAUDER_CYD_2USB)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 22 // Whoever thought it would be a good idea to use UART0 for GPS...
      #define GPS_RX 27 // Now maybe we will be able to use CLI
    #elif defined(MARAUDER_CYD_3_5_INCH)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 25
    #elif defined(MARAUDER_CYD_GUITION)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21 // Fits the extended I/O
      #define GPS_RX 22
    #elif defined(MARAUDER_V4)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 4
      #define GPS_RX 13
    #elif defined(MARAUDER_KIT)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 4
      #define GPS_RX 13
    #elif defined(MARAUDER_DEV_BOARD_PRO)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 17
    #elif defined(MARAUDER_MINI)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 22
    #elif defined(MARAUDER_V7)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 22
    #elif defined(MARAUDER_V7_1)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 22
    #elif defined(MARAUDER_FLIPPER)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 9
      #define GPS_RX 21
    #elif defined(MARAUDER_MULTIBOARD_S3)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 9
      #define GPS_RX 21
    #elif defined(MARAUDER_M5STICKC)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 33
      #define GPS_RX 32
    #elif defined(MARAUDER_CARDPUTER)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 1
      #define GPS_RX 2
    #elif defined(MARAUDER_REV_FEATHER)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 6
      #define GPS_RX 9
    #elif defined(MARAUDER_C5)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #elif defined(MARAUDER_V8)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #elif defined(MARAUDER_MINI_V3)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #endif
  #else
    #define mac_history_len 100
    #define mac_history_len_half (mac_history_len / 2)
  #endif
  //// END GPS STUFF

  //// BATTERY STUFF
  #ifdef HAS_BATTERY

    #ifdef MARAUDER_V4
      #define I2C_SDA 33
      #define I2C_SCL 22
    #endif

    #ifdef MARAUDER_V6
      #define I2C_SDA 33
      #define I2C_SCL 22
    #endif

    #ifdef MARAUDER_V6_1
      #define I2C_SDA 33
      #define I2C_SCL 22
    #endif

    #ifdef MARAUDER_M5STICKC
      #define I2C_SDA 33
      #define I2C_SCL 22
    #endif

    #ifdef MARAUDER_KIT
      #define I2C_SDA 33
      #define I2C_SCL 22
    #endif

    #ifdef MARAUDER_MINI
      #define I2C_SDA 33
      #define I2C_SCL 26
    #endif

    #ifdef MARAUDER_V7
      #define I2C_SDA 33
      #define I2C_SCL 16
    #endif

