execphantasmagoria/ESP32MarauderOLED_BN/esp32_marauder/configs.h
    #ifdef MARAUDER_V7_1
      #define I2C_SDA 33
      #define I2C_SCL 27
    #endif

    #ifdef MARAUDER_CYD_MICRO
      #define I2C_SDA 22
      #define I2C_SCL 27
    #endif

    #ifdef MARAUDER_CYD_2USB
      #define I2C_SDA 22
      #define I2C_SCL 27
    #endif

    #ifdef MARAUDER_CYD_3_5_INCH
      #define I2C_SDA 32
      #define I2C_SCL 25
    #endif

    #ifdef MARAUDER_CYD_GUITION
      #define I2C_SDA 22
      #define I2C_SCL 21
    #endif

    #ifdef MARAUDER_V8
      #define I2C_SCL 4
      #define I2C_SDA 5
    #endif

  #endif

  //// MARAUDER TITLE STUFF
  #ifdef MARAUDER_V4
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_MICRO)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_2USB)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_3_5_INCH)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_GUITION)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_KIT)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_MINI)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V7)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V7_1)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_REV_FEATHER)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_C5)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V8)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_MINI_V3)
    #define MARAUDER_TITLE_BYTES 13578
  #else
    #define MARAUDER_TITLE_BYTES 13578
  #endif
  //// END MARAUDER TITLE STUFF

  //// PCAP BUFFER STUFF
  
  #ifdef HAS_PSRAM
    #define BUF_SIZE 8 * 1024 // Had to reduce buffer size to save RAM. GG @spacehuhn
    #define SNAP_LEN 1 * 4096 // max len of each recieved packet
  //#elif !defined(HAS_ILI9341)
  //  #define BUF_SIZE 8 * 1024 // Had to reduce buffer size to save RAM. GG @spacehuhn
  //  #define SNAP_LEN 4096 // max len of each recieved packet
  #else
    #define BUF_SIZE 3 * 1024 // Had to reduce buffer size to save RAM. GG @spacehuhn
    #define SNAP_LEN 2324 // max len of each recieved packet
  #endif

  //// PCAP BUFFER STUFF

  //// STUPID CYD STUFF
  #if defined(HAS_CYD_TOUCH) || defined(HAS_C5_SD) || defined(HAS_SEPARATE_SD)
    #ifdef MARAUDER_CYD_MICRO
      #define XPT2046_IRQ  36
      #define XPT2046_MOSI 32
      #define XPT2046_MISO 39
      #define XPT2046_CLK  25
      #define XPT2046_CS   33

      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #ifdef MARAUDER_CYD_2USB
      #define XPT2046_IRQ  36
      #define XPT2046_MOSI 32
      #define XPT2046_MISO 39
      #define XPT2046_CLK  25
      #define XPT2046_CS   33

      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #ifdef MARAUDER_CYD_3_5_INCH
      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #ifdef MARAUDER_C5
      #define SD_MISO 2
      #define SD_MOSI 7
      #define SD_SCK  6
    #endif

    #ifdef MARAUDER_V8
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V4
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V6
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V6_1
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_KIT
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_MINI
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V7
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_MINI_V3
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif
  #endif
  //// END STUPID CYD STUFF

  //// FUNNY FLIPPER LED STUFF

  #ifdef HAS_FLIPPER_LED
    #ifdef MARAUDER_FLIPPER
      #define B_PIN 4
      #define G_PIN 5
      #define R_PIN 6
    #endif

    #ifdef MARAUDER_MULTIBOARD_S3
      #define B_PIN 4
      #define G_PIN 5
      #define R_PIN 6
    #endif

    #ifdef MARAUDER_CYD_MICRO
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

    #ifdef MARAUDER_CYD_2USB
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

    #ifdef MARAUDER_CYD_3_5_INCH
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 22
    #endif

    #ifdef MARAUDER_CYD_GUITION
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif
  #endif

  //// END FUNNY FLIPPER LED STUFF

  //// WIFI STUFF

  #ifndef HAS_DUAL_BAND
    #define HOP_DELAY 1000
  #else
    #define HOP_DELAY 250
  #endif
#endif
